; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl2)
	(at plane2 city12)
	(fuel-level plane2 fl5)
	(at plane3 city5)
	(fuel-level plane3 fl6)
	(at plane4 city15)
	(fuel-level plane4 fl5)
	(at plane5 city8)
	(fuel-level plane5 fl5)
	(at plane6 city11)
	(fuel-level plane6 fl4)
	(at person1 city11)
	(at person2 city12)
	(at person3 city13)
	(at person4 city6)
	(at person5 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city3)
	(at person1 city3)
	(at person2 city7)
	(at person3 city8)
	(at person4 city6)
	(at person5 city5)
	))

)

; plan
1. (board person1 plane6 city11)
   deleted: (at person1 city11)
   added: (in person1 plane6)
   goals met: 1 of 6
2. (zoom plane6 city11 city3 fl4 fl3 fl2)
   deleted: (at plane6 city11) (fuel-level plane6 fl4)
   added: (at plane6 city3) (fuel-level plane6 fl2)
   goals met: 1 of 6
3. (debark person1 plane6 city3)
   deleted: (in person1 plane6)
   added: (at person1 city3)
   goals met: 2 of 6
4. (board person2 plane2 city12)
   deleted: (at person2 city12)
   added: (in person2 plane2)
   goals met: 2 of 6
5. (zoom plane2 city12 city13 fl5 fl4 fl3)
   deleted: (at plane2 city12) (fuel-level plane2 fl5)
   added: (at plane2 city13) (fuel-level plane2 fl3)
   goals met: 2 of 6
6. (board person3 plane2 city13)
   deleted: (at person3 city13)
   added: (in person3 plane2)
   goals met: 2 of 6
7. (zoom plane2 city13 city3 fl3 fl2 fl1)
   deleted: (at plane2 city13) (fuel-level plane2 fl3)
   added: (at plane2 city3) (fuel-level plane2 fl1)
   goals met: 3 of 6
8. (zoom plane1 city0 city2 fl2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl2)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 3 of 6
9. (zoom plane3 city5 city2 fl6 fl5 fl4)
   deleted: (at plane3 city5) (fuel-level plane3 fl6)
   added: (at plane3 city2) (fuel-level plane3 fl4)
   goals met: 3 of 6
10. (board person5 plane3 city2)
   deleted: (at person5 city2)
   added: (in person5 plane3)
   goals met: 3 of 6
11. (zoom plane3 city2 city5 fl4 fl3 fl2)
   deleted: (at plane3 city2) (fuel-level plane3 fl4)
   added: (at plane3 city5) (fuel-level plane3 fl2)
   goals met: 3 of 6
12. (debark person5 plane3 city5)
   deleted: (in person5 plane3)
   added: (at person5 city5)
   goals met: 4 of 6
13. (fly plane2 city3 city7 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 3 of 6
14. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 6
15. (debark person2 plane2 city7)
   deleted: (in person2 plane2)
   added: (at person2 city7)
   goals met: 4 of 6
16. (fly plane2 city7 city8 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 4 of 6
17. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 4 of 6
18. (debark person3 plane2 city8)
   deleted: (in person3 plane2)
   added: (at person3 city8)
   goals met: 5 of 6
19. (fly plane2 city8 city3 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 6 of 6
